In [47]:
import numpy as np

In [46]:
#Panda pacote que manipula planilhas.
#ou tabelas
import pandas as pd

In [14]:
#Criando series
#Uma serie é um array unidimensional composto por labels e dados
#Podemos criar uma serie sem label
s1 = pd.Series([23, 77, 0, 5, 12])

In [8]:
print(s1)

0    23
1    77
2     0
3     5
4    12
dtype: int64

In [9]:
s1

0    23
1    77
2     0
3     5
4    12
dtype: int64

In [15]:
#Caso queremos verificar os valores da seirie, usamos a propriedade values
s1.values

array([23, 77,  0,  5, 12], dtype=int64)

In [12]:
print(s1.values)

[23 77  0  5 12]

In [13]:
# Caso queira ferificar o indices da serie
s1.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

In [17]:
#Para criar uma serie e especificar os seus indices devemos passar cada dos rótulos
s2 = pd.Series([23, 77, 0, 5, 12], index = ['A','B','C','D','E'])
s2

A    23
B    77
C     0
D     5
E    12
dtype: int64

In [20]:
#Ver os index
print(s2.index)

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [21]:
#Para fatiar a serie, podemos usar
s2[:2]

A    23
B    77
dtype: int64

In [22]:
#Para fatiar a serie, podemos usar
s2[:3]

A    23
B    77
C     0
dtype: int64

In [24]:
# Podemos ainda usar expressões com operadores relacionais
# Um exemplo é retornar os elementos maiores que 20
s2[s2>20]

A    23
B    77
dtype: int64

In [25]:
s2[s2<=10]

C    0
D    5
dtype: int64

In [26]:
s2[s2>=10]

A    23
B    77
E    12
dtype: int64

In [27]:
# Para trabalhar com uma posição específica da serie, devemos especificar o
#seu index que pode ser um label ou um índice numérico do array
s2['A']

23

In [28]:
s2[0]

23

In [31]:
# Para alterar o valor de uma posição
s2['A']=100
s2[0]

100

In [33]:
print(s2)

A    100
B     77
C      0
D      5
E     12
dtype: int64

In [35]:
# Imagine que temos uma série faltando valor
s3 = pd.Series([23, 77, 0, 5, 12,np.NaN], index = ['A', 'B', 'C', 'D', 'E','F'])
s3

A    23.0
B    77.0
C     0.0
D     5.0
E    12.0
F     NaN
dtype: float64

In [36]:
# Podemos verificar se existem dados faltantes ou se os dados são nulos
pd.isnull(s2)

A    False
B    False
C    False
D    False
E    False
dtype: bool

In [37]:
pd.isnull(s3)

A    False
B    False
C    False
D    False
E    False
F     True
dtype: bool

In [38]:
# Podemos também fazer o oposto, verificando qual não é nulo
pd.notnull(s3)

A     True
B     True
C     True
D     True
E     True
F    False
dtype: bool

In [39]:
s4 = s2 + s3

In [41]:
# Analise a saída dessa concatenação
s4

A    123.0
B    154.0
C      0.0
D     10.0
E     24.0
F      NaN
dtype: float64

In [42]:
# Dataframes possuem index e linhas semelhantes a uma planilha
# Inicialmente criaremos um dicionário
dados= {'Ano':[2014, 2015, 2016, 2017, 2018, 2019], 'Pais':['EUA', 'China', 'Brasil', 'Canada', 'Portugal', 'Espanha'], 'Vendas':[50, 60, 70, 40, 10, 88]}

In [59]:
# Podemos criar um dataframe a partir desse dicionário
df = pd.DataFrame(dados)
df

    Ano      Pais  Vendas
0  2014       EUA      50
1  2015     China      60
2  2016    Brasil      70
3  2017    Canada      40
4  2018  Portugal      10
5  2019   Espanha      88

In [76]:
#Podemos adicionar colunas que não existem no dicionária quando criarmos o dataFrame, lembrando que esses dados serão nulos.
df2 = pd.DataFrame(dados, columns = ['Ano', 'Pais', 'Vendas', 'Valores'], index = ['A', 'B', 'C', 'D', 'E','F'] )
df2

    Ano      Pais  Vendas Valores
A  2014       EUA      50     NaN
B  2015     China      60     NaN
C  2016    Brasil      70     NaN
D  2017    Canada      40     NaN
E  2018  Portugal      10     NaN
F  2019   Espanha      88     NaN

In [68]:
#Inserindo dados na coluna valores
#Neste exemplo, a função loc é usada para acessar os valores específicos na coluna Valores para os índices A
df2.loc['A', 'Valores'] = 100
df2

    Ano      Pais  Vendas Valores
A  2014       EUA      50     100
B  2015     China      60     NaN
C  2016    Brasil      70     NaN
D  2017    Canada      40     NaN
E  2018  Portugal      10     NaN
F  2019   Espanha      88     NaN

In [69]:
#Neste exemplo, a função iat é usada para acessar os valores específicos na coluna Valores para as linhas 0.
df2.iat[0,3] = 150
df2

    Ano      Pais  Vendas Valores
A  2014       EUA      50     150
B  2015     China      60     NaN
C  2016    Brasil      70     NaN
D  2017    Canada      40     NaN
E  2018  Portugal      10     NaN
F  2019   Espanha      88     NaN

In [80]:
#Agora, vejamos alguns exemplos juntando o Pandas e Numpy:
# É possível usar o Numpy para preencher a coluna de nosso dataframe, denominada Valores e que inicialmente estava vazia
# Preencheremos com valores randômicos 
df2['Valores'] = np.random.rand(6)*100
df2

    Ano      Pais  Vendas    Valores
A  2014       EUA      50  55.044198
B  2015     China      60  82.734383
C  2016    Brasil      70  71.773919
D  2017    Canada      40  96.647150
E  2018  Portugal      10  12.466890
F  2019   Espanha      88   6.671826

In [81]:
#Um método bem interessante é o describe(), que descreve os dados dataFrame; este metodo retorna
# count = número de registros (linhas)
# mean = média dos valores por coluna
# std = desvio padrão
# min = valor mínimo da amostra
# quartis = 25%, 50% e 75%
# max = valor máximo da amostra
df2.describe()

               Ano     Vendas    Valores
count     6.000000   6.000000   6.000000
mean   2016.500000  53.000000  54.223061
std       1.870829  26.795522  37.218553
min    2014.000000  10.000000   6.671826
25%    2015.250000  42.500000  23.111217
50%    2016.500000  55.000000  63.409059
75%    2017.750000  67.500000  79.994267
max    2019.000000  88.000000  96.647150

In [82]:
df2.max()

Ano            2019
Pais       Portugal
Vendas           88
Valores    96.64715
dtype: object

In [85]:
df2.min()

Ano            2014
Pais         Brasil
Vendas           10
Valores    6.671826
dtype: object

In [86]:
#É possivel fatiar o dataFrame por meio do nome dos índices
df2['A':'D']

    Ano    Pais  Vendas    Valores
A  2014     EUA      50  55.044198
B  2015   China      60  82.734383
C  2016  Brasil      70  71.773919
D  2017  Canada      40  96.647150

In [87]:
#Podemos pesquisar e retornar os dados somente de um índice
df2.loc['D']

Ano            2017
Pais         Canada
Vendas           40
Valores    96.64715
Name: D, dtype: object

In [88]:
#Como você deve ter percebido, Pandas é um pacote sofisticado para manipular
#dados, podendo ser utilizado junto ao Numpy para preparar os dados que serão
#examinados. É comum prepararmos dados com esses pacotes para, então, 
#plotarmos – desenharmos – gráficos com a biblioteca Matplotlib – que veremos a seguir